Step_3/small_jet_base_AMR/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
	#includeEtc "caseDicts/setConstraintTypes"

    jet_inlet
    {
        type            calculated;
	value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }
    top
    {
        type            calculated;
        value           $internalField;
    }

    bottom
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    wall_inlet
    {
        type            calculated;
        value           $internalField;
    }

    "(left_side|right_side)"
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
