Step_3/small_jet_base_AMR/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

topoChanger
{
    type            refiner;

    libs            ("libfvMeshTopoChangers.so");

    mover           none;

    // How often to refine
    refineInterval  10;

    // Field to be refinement on
    field           k;

    // Refine field in between lower..upper
    lowerRefineLevel 0.018;
    upperRefineLevel 0.04;
    
    unrefineLevl 0.018;

    // Have slower than 2:1 refinement
    nBufferLayers   2;

    // Refine cells only up to maxRefinement levels
    maxRefinement   2;

    // Stop refinement if maxCells reached
    maxCells        10000000;

    // Write the refinement level as a volScalarField
    dumpLevel       false;

    // Use the correctPhi setting in fvSolution.
    correctFluxes (
		    (phi none)
		    (phi_0 none) 
		    (ghf none)
		  );

}
/*
distributor
{
    type            distributor;

    libs            ("libfvMeshDistributors.so");
    redistributionInterval  20;
}
*/
// ************************************************************************* //
