Step_3/small_jet_base_AMR/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
#includeFunc scalarTransport(scalar,alphal=1,alphat=1)
*/
    residuals
{
    type            residuals;

    libs            ("libutilityFunctionObjects.so");

    writeControl    timeStep;
    writeInterval   5;
    fields
    (
        U
        p_rgh
        k
        h
        s
    );
}

// ************************************************************************* //

